clear;
clc;
close all;

k = 0:9;
for i=0:9
    for n=0:100
        %x(n+1) = cos(3*pi*n*k(i+1)/2);
        x(n+1) = cos(3*pi*n*i/2);
        subplot(5,2,i+1);
        stem(x);
        title(['k=',num2str(i)]);
    end
end



%مشاهده می شود که به ازای هارمونی صفرم (k=0) سیگنال ثابت شده است و مقدار ان
%یک شده است.
%به ازای هارمونی اول (k=1) ، هارمونی صفرم(k=0) و هارمونی دوم (k=2) سیگنال
%غیر تکراری است بعد از ان سیگنال در هارمونی های فرد دقیقا همانند هارمونی
%اول است و عیناتکرار شده است. در هارمونی های زوج دو حالت رخ داده است به
%ازای مقادیر صحیح حاصل ضرب kدرw مقدار سیگنال صفر شده است(هارمونی های صفرم،
%چهارم و هشتم) و به ازای مقادیر گویای حاصل ضرب kدرw سیگنال یک در میان یک و
%منفی یک شده است(هارمونی های دوم و ششم)
%این امر به دلیل ان است که اگر طبق رابطه اویلر این سیگنال را به صورت نمایی
%خود بنویسیم، فازور نمایی گسسته، با افزایش اندیس های هارمونی ها (مقدار k)
%تغییرات سگنال با طور مستمر افزایش نمی یابد و هارمونی های سیگنال تکرار
%خواهند شد